{
  "categories": {
    "technology": [
      {
        "title": "Blog site",
        "cover": "https://img-blog.csdnimg.cn/521dd9cc58144e1a94f3de8fef9cc872.jpg",
        "filename": "blog_site.md",
        "summary": "Hey there, welcome to my blog site, this is the first time I've used Rust to build WEB App, also this is my first time to write blog in English, It's a bold attempt for me to write blog using English,",
        "content": "Hey there, welcome to my blog site, this is the first time I've used Rust to build WEB App, also this is my first time to write blog in English, It's a bold attempt for me to write blog using English, so not surprisingly there will be a lot of grammatical errors, but I still wanna stick to writing blog in English cause this is a change to practice my English, anyway I hope u have a good time here.\n\n## About the website\nSo uh why would I wanna write a blog site like this? The first and also is a important reason is I wanna create a space that can record all my thoughts, includes interesting or boring thoughts, opinions on some technology etc. just I need a space like that where I can write these thoughts down, cause I think the thoughts is one of the most important things for people.\n\nAfter about 100 years, I'm dead, I would feel regrettable that I never think about the world.\n\nAnd the second reason is that I like programming and of course the programming is one of my favorite things, I used to writ some blog post in the other platform which like CSDN, also u can find my old blog site [here](https://blog.csdn.net/HaoDaWang). The CSDN is a blog platform that u publish ur posts in their servers, and also u can do some action which like search posts, like the post, reply the post or some interaction like that, therefore the CSDN is more like a technology community, but don't forget also It's a company, so some commercial services starting appear to the CSDN which broke the user experience, and I can't stand to write blog there. About 1 years ago I was thinking about create a own website as a storage that store my thoughts of collections, So here we are 🎉! \n\nThe final reason is I'm looking for a feeling about building a product, not just I'm a software engineer, It's something like design details of product or add some feature which I wanna added whatever it's useful or useless. In additional, I wanna write some quality articles seriously, not just write a quite blog that I have no idea what I'm fucking writing, I wanna make some change.\n\nFinally, this blog is a open source project, u can find it in [zzhack-stack/zzhack](https://github.com/zzhack-stack/zzhack).\n\n### Under the hood\nThis site is building based on Rust & Yew, since the browser can run languages other than JavaScript, the compiler of these language can compile to WASM and run in the browser, I think It's so interesting and innovative, so I found the [Yew](https://yew.rs/).\n\nThe [Yew](https://yew.rs/) is a framework of Rust for building client web app, the interesting things is that it makes trick use of Rust's macro to express construction of component, a component may looks like:\n\n```rust\nstruct Foo {}\n\nimpl Component for Foo {\n    fn view(&self) -> Html {\n        html! {\n            <div></div>\n        }\n    }\n}\n```\n\nThat's fucking awesome! which means that u can write component in Rust just like React or some JSX based framework, but the Yew is based on wasm-bindgen which means the dist code is a bundle of `WASM & JS` (cause the WASM cannot access DOM directly, so u may like access DOM using JS and then lnk the JS module in ur WASM module) rather than JS bundle.\n\n### Where does the blog data comes from?\nMay u have notice that this site is not a STATIC WEBSITE, it's dynamically, the data comes from CDN nodes, when I write post down and commit it to repository, the post would be upload to CDN automatically, I was writing a script to make the flow execution automatically using Python 3.9, and the tool is also open source, u can find it in [zzhack-stack/zzhack-provider](https://github.com/zzhack-stack/zzhack-provider).\n\nOf course the site source code and data r store separately in two deference repositories. May u wanna asked why not do static compile post file to dist and publish to CDN, it's looks like simpler and faster, cause I wanna make a architecture which like C/S arch, it's easier to expand client endpoint, assume that I have a iOS/Android client or WeChat mini-program client to show my posts, the clients share the same data, if I compile the posts into the dist bundle, and publish it with source code, of course it would be more manageable and it would be simpler, but I don't wanna compile for 4 times.\n\nAnd It's worth mention that the website were deploying on Vercel, and also there's no \"server\" here, so this blog site also is a server-less app.\n\n### How to add comments to the post\nThere have an 1:1 relationship between GitHub issues and blog posts, u can add comments via GitHub API, and u have to login via GitHub OAuth before comment, and the content of comments will appear to the end of the issue. And when u refresh the page, the app will pull the comments data from issues via GitHub API, that's all details that u wanna to know about comments system of the blog site.\n\nAnyway happy landing! \n",
        "create_at": 1637940669697,
        "issue_id": 15,
        "update_at": 1640232135119
      }
    ],
    "thinking": [
      {
        "title": "Be a contradiction man",
        "cover": "https://cdn.ahlele.com/assets/images/conflicted_man_cover.svg",
        "filename": "be_a_contradiction_man.md",
        "create_at": 1641121281858,
        "summary": "Today is the second day of the 2022 NEW YEAR, in the new year, I hope to be a special person, a contradiction person.\n\n```spotlight\nBrave and cowardly\n```\n\n```spotlight\nDiligent and lazy\n```\n\n```spotl",
        "content": "Today is the second day of the 2022 NEW YEAR, in the new year, I hope to be a special person, a contradiction person.\n\n```spotlight\nBrave and cowardly\n```\n\n```spotlight\nDiligent and lazy\n```\n\n```spotlight\nWanna make more friends and prefer to be alone\n```\n\nAnd finally I wanna stick to idealism but if I failed I also allow myself to be a little bit realistic.\n\n",
        "update_at": 1641122626727,
        "issue_id": 19
      },
      {
        "title": "My life",
        "cover": "https://cdn.ahlele.com/assets/images/into_the_wild.jpg",
        "filename": "blog_site.md",
        "summary": "Recently I was re-watched a movie which is one of my favorite movies, called \"Into the wild\", as u can see the cover is scene from the movie. there r so many lines in this movie that I really like, fo",
        "content": "Recently I was re-watched a movie which is one of my favorite movies, called \"Into the wild\", as u can see the cover is scene from the movie. there r so many lines in this movie that I really like, for instance the \"Super tramp\" said:\n\n```spotlight\nIf u want something in life, just reach out and grab it.\n```\n\nWhich brings me to some bad truths, if I wanna do something I always thinking about a lot of relevant factor or rewards of doing it, the truth is I always thinking about result before doing it. I think this is a good habits about how to do right things, but sometimes not, cause if we do like that, always thinking about too many factor before do the thing, we will lose the enthusiasm to do it.\n\nFundamentally, I'm not brave, I can't take the risk of failing things even I have enough enthusiasm. \n\nI realized that I was wrong at some parts, perhaps I should just do what I love to do even fail. I started planning my trip last year but never did, I spend most of my time calculating the cost of my trip and various events that I may encounter along the way, It's time to do that I suppose :).\n\nAnd I also like a other line in the \"Into the wild\", the Super tramp said:\n\n```spotlight\nGod's placed it all around us. It's in everything. It's in anything we can experience. People just need to change the way they look at those things.\n```\n\nI started thinking about How should I live when I was 20 years old, I've spend most of my life thinking about trivial things, \"What if I don't get into a good college?\", \"How soon I can afford a house in China?\", \"What kind of job should I take?\", I used to think these things were really important to my life, as a result I always focus on such things and ignore the wonderful things. Life means discovering and experiencing, maybe I don't have to working hard, I don't have to worry about interpersonal relationships and maybe I don't have to thinking how should I live, just do what I love to do.\n\nIt's like the lines said people just need to change the way they look at those things.\n\n",
        "create_at": 1640178467035,
        "update_at": 1640183706792,
        "issue_id": 16
      }
    ]
  }
}