{
  "title": "My life",
  "cover": "https://cdn.ahlele.com/assets/images/into_the_wild.jpg",
  "filename": "blog_site.md",
  "summary": "Recently I was re-watched a movie which is one of my favorite movies, called \"Into the wild\", as u can see the cover is scene from the movie. there r so many lines in this movie that I really like, fo",
  "content": "Recently I was re-watched a movie which is one of my favorite movies, called \"Into the wild\", as u can see the cover is scene from the movie. there r so many lines in this movie that I really like, for instance the \"Super tramp\" said:\n\n```spotlight\nIf u want something in life, just reach out and grab it.\n```\n\nWhich brings me to some bad truths, if I wanna do something I always thinking about a lot of relevant factor or rewards of doing it, the truth is I always thinking about result before doing it. I think this is a good habits about how to do right things, but sometimes not, cause if we do like that, always thinking about too many factor before do the thing, we will lose the enthusiasm to do it.\n\nFundamentally, I'm not brave, I can't take the risk of failing things even I have enough enthusiasm. \n\nI realized that I was wrong at some parts, perhaps I should just do what I love to do even fail. I started planning my trip last year but never did, I spend most of my time calculating the cost of my trip and various events that I may encounter along the way, It's time to do that I suppose :).\n\nAnd I also like a other line in the \"Into the wild\", the Super tramp said:\n\n```spotlight\nGod's placed it all around us. It's in everything. It's in anything we can experience. People just need to change the way they look at those things.\n```\n\nI started thinking about How should I live when I was 20 years old, I've spend most of my life thinking about trivial things, \"What if I don't get into a good college?\", \"How soon I can afford a house in China?\", \"What kind of job should I take?\", I used to think these things were really important to my life, as a result I always focus on such things and ignore the wonderful things. Life means discovering and experiencing, maybe I don't have to working hard, I don't have to worry about interpersonal relationships and maybe I don't have to thinking how should I live, just do what I love to do.\n\nIt's like the lines said people just need to change the way they look at those things.\n\n",
  "create_at": 1640178467035,
  "update_at": 1640183706792,
  "issue_id": 16
}
